Repository: MelberGithub/mx-rofi-manager
Catalog: translations_script/po/mx-rofi-manager_*.po
Languages: gl_es

source: SPECIFIC AND GLOBAL SETTINGS Settings for position, size and font can have two formats: --Specific: settings come directly from the <some name.rasi> file with its particular values. Rofi manager can edit the specific settings of User themes (~/.config/rofi/themes/<some name.rasi>) but those of Extra and System themes can only be changed with a text editor. --Global: settings come from a separate file (~/.config/rofi/themes/mxrm-settings/mxrm-settings.rasi) and are applied to all themes. Rofi manager can edit these by changing the current theme to that file.
gl_es: CONFIGURACIÓNS ESPECÍFICAS E GLOBAIS As configuracións de posición, tamaño e fonte poden ter dous formatos: --Específicas: as configuracións veñen directamente do ficheiro <nome.rasi> coas súas valores particulares. O xestor de Rofi pode editar as configuracións específicas dos temas do usuario (~/.config/rofi/themes/<some name.rasi>), pero as dos temas Extra e do Sistema só se poden cambiar cun editor de texto. --Globais: as configuracións veñen dun ficheiro separado (~/.config/rofi/themes/mxrm-settings/mxrm-settings.rasi) e aplícanse a todos os temas. O xestor de Rofi pode editar estas cambiando o tema actual por ese ficheiro.

source: TERMS - LOCATION: The general placement of the rofi window on the screen - ANCHOR: The point of the rofi window which is set at the location. - X-OFFSET & Y-OFFSET: The offset (pixels) of the rofi window from the anchor point EXAMPLES Location center, anchor center: places the center of the rofi window at the center of the screen Location northwest, anchor northwest: places the top left corner of the rofi window at the top left of the screen. Location center, anchor northwest: places the top left corner of the rofi window at the center of the screen. Location west, anchor west, x-offset 32: displaces the rofi window to avoid overlap with a vertical panel.
gl_es: TERMS - LOCALIZACIÓN: A colocación xeral da xanela rofi na pantalla - ANCLA: O punto da xanela rofi que se establece na localización. - DESPRACAMENTO X E DESPRACAMENTO Y: O desprazamento (píxeles) da xanela rofi desde o punto de anclaxe EXEMPLOS Localización centro, ancla centro: coloca o centro da xanela rofi no centro da pantalla Localización noroeste, ancla noroeste: coloca o canto superior esquerdo da xanela rofi no canto superior esquerdo da pantalla. Localización centro, ancla noroeste: coloca o canto superior esquerdo da xanela rofi no centro da pantalla. Localización oeste, ancla oeste, desprazamento x 32: despraza a xanela rofi para evitar a superposición cun panel vertical.

source: X-Offset (- to left, + to right)
gl_es: Desprazamento-X ( - á esquerda, + á dereita)

source: Y-Offset (- upwards, + downwards)
gl_es: Desprazamento-Y (- cara arriba, + cara abaixo)

source: <b>Adjust the font of the current rofi window.</b>
gl_es: <b>Ajusta a fonte da xanela actual de rofi.</b>

source: <b>Adjust the location and size of the current rofi window.\n</b>
gl_es: <b>Ajusta a localización e o tamaño da xanela actual de rofi.\n</b>

source: <b>Make new theme current?</b>
gl_es: <b>Facer o novo tema actual?</b>

source: <b>Name for new style</b>
gl_es: <b>Nome para novo estilo</b>

source: <b>Name for new theme</b>
gl_es: <b>Nome para novo tema</b>

source: <b>Name for new theme</b>
gl_es: <b>Nome para novo tema</b>

source: <b>Rofi Manager is a tool to configure rofi themes.\n\n<i>What would you like to do?</i></b>\n
gl_es: <b>Xestor de Rofi é unha ferramenta para configurar temas de rofi.\n\n<i>Que che gustaría facer?</i></b>\n

source: <b>Select appearance settings and theme to use</b> (double-click for preview).
gl_es: <b>Seleccione as configuracións de aparencia e o tema a utilizar</b> (faga dobre clic para previsualizar).

source: <b>Select which tabs rofi should display</b>\n
gl_es: <b>Selecciona qué pestañas debe mostrar rofi</b>\n

source: <b>\nEdit colors and create a new rofi theme.\n\n</b>
gl_es: <b>\nEditar cores e crear un novo tema rofi.\n\n</b>

source: A Theme with this name already exists. \n\nDo you want to overwrite <b>$NEWNAME</b>\nor save as a different theme name?\n
gl_es: Xa existe un tema con este nome. \n\nQueres sobrescribir <b>$NEWNAME</b> ou gardar cun nome de tema diferente?\n

source: Active Tab Background
gl_es: Fondo da lapela activa

source: Active Tab Highlight
gl_es: Destaque da Tab Activa

source: Active Tab Text
gl_es: Texto da lapela activa.

source: All done!\n<b>$NEWNAME</b> Rofi theme has been created.\n\nYou can change themes with <b>MX-Rofi-Manager</b>
gl_es: Todo feito!\nO tema Rofi <b>$NEWNAME</b> foi creado.\n\nPodes cambiar os temas con <b>MX-Rofi-Xestor</b>

source: All done!\n<b>$NEWNAME</b> has been set as the current rofi theme.
gl_es: Todo feito!\n<b>$NEWNAME</b> foi establecido como o tema actual de rofi.

source: All done!\nFont of the current rofi theme has been amended.
gl_es: Todo feito!\nA fonte do tema actual de rofi foi modificada.

source: All done!\nPosition and size of the current rofi theme have been amended.
gl_es: Todo feito!\nA posición e o tamaño do tema actual de rofi foron corrixidos.

source: All done!\n\n<b>$NEWTHEME</b> has been set as the current rofi theme.\n\n
gl_es: Todo feito!\n\n<b>$NEWTHEME</b> foi establecido como o tema actual de rofi.\n\n

source: All done!\n\nTab configuration has been updated.\n\n
gl_es: Todo feito!\n\nA configuración da lapela foi actualizada.\n\n

source: Change the current rofi theme
gl_es: Cambiar o tema actual de rofi

source: Change the font of the current rofi window
gl_es: Cambiar a fonte da xanela actual de rofi

source: Change the functions (<i> modi </i>) of the rofi tabs
gl_es: Cambiar as funcións (<i> modi </i>) das lapelas do rofi

source: Change the location and size of the current rofi window
gl_es: Cambiar a localización e tamaño da xanela actual de rofi

source: Edit a rofi theme config file in text editor
gl_es: Editar un ficheiro de configuración do tema rofi nun editor de texto

source: Font
gl_es: Fonte

source: Global settings are blocked for
gl_es: As configuracións globais están bloqueadas para

source: Height (number of lines shown in list)
gl_es: Altura (número de liñas mostradas na lista)

source: If a theme does not display tabs, switch tabs with <i>Shift + Arrow</i> or <i>Ctrl + Tab</i>\n
gl_es: Se un tema non mostra lapelas, cambia as lapelas con <i>Shift + Arrow</i> ou <i>Ctrl + Tab</i>\n

source: Inactive Tab Background
gl_es: Fondo da lapela inactiva

source: Inactive Tab Text
gl_es: Texto da lapela inactiva

source: Location of rofi window on the screen
gl_es: Localización da xanela de rofi na pantalla

source: MX Rofi manager provides a fast and easy way to manipulate the handy app rofi and its many possible functions ("modi"). Available actions: --select the functions to be shown --switch the current theme --adjust colors, font and position (default themes only) --edit themes manually --access documentation For more details, consult the rofi "help" tab.
gl_es: MX Rofi xestor proporciona unha forma rápida e sinxela de manipular a práctica aplicación rofi e as súas moitas funcións posibles ("modi"). Accións dispoñibles: --seleccionar as funcións que se mostrarán --cambiar o tema actual --axustar cores, fonte e posición (só temas predeterminados) --editar temas manualmente --acceder á documentación Para obter máis detalles, consulte a lapela de axuda de rofi.

source: MX-Rofi-Help
gl_es: MX-Rofi-Axuda

source: MX-Rofi-Manager
gl_es: MX-Rofi-Xestor

source: MX-Rofi-Recolor Help
gl_es: MX-Rofi-Recolor Axuda

source: New theme name
gl_es: Novo nome do tema

source: No Theme name!
gl_es: Ningún nome de tema!

source: No change to current settings!\n
gl_es: Ningún cambio nas configuracións actuais!\n

source: No theme selected.
gl_es: Ningún tema seleccionado.

source: No theme selected.\n\n<b>MX-comfort</b> will be used as the starting theme.
gl_es: Ningún tema seleccionado.\n\n<b>MX-comfort</b> será utilizado como el tema de inicio.

source: OK to proceed?
gl_es: Continuar?

source: Overwrite $NEWNAME
gl_es: Sobrescribe $NEWNAME

source: Recolor a rofi theme based on MX-comfort
gl_es: Recolorar un tema rofi baseado en MX-comfort

source: Return to Main Window
gl_es: Volver á ventá principal

source: Rofi-Edit
gl_es: Rofi-Editar

source: Rofi-Font
gl_es: Rofi-Fonte

source: Rofi-Position
gl_es: Rofi-Posición

source: Rofi-Tab-Selector
gl_es: Rofi-Selector-Tab

source: Rofi-Theme
gl_es: Rofi-Tema

source: Save as different theme name
gl_es: Gardar co nome de tema diferente

source: Searchbar Background
gl_es: Fondo da barra de busca

source: Searchbar Text
gl_es: Texto da barra de busca

source: Selection Background
gl_es: Fondo de selección

source: Selection Text
gl_es: Texto de selección

source: Settings
gl_es: Configuracións

source: Sorry, the appearance settings for $ROFICURRENT can only be modified using global settings.\n\nWould you like to change to global settings?.\n\n
gl_es: Desculpa, a configuración de aparencia para $ROFICURRENT só pode ser modificada usando a configuración global.\n\nGustaríache cambiar á configuración global?\n\n

source: Specific settings will be used
gl_es: Configuracións específicas serán utilizadas

source: The current appearance settings are <b>$TOGGLETEXT</b>
gl_es: As configuracións de aparencia actuais son <b>$TOGGLETEXT</b>

source: The current theme is <b>$ROFICURRENT</b> and its settings are <b>$TOGGLETEXT</b>.
gl_es: O tema actual é <b>$ROFICURRENT</b> e as súas configuracións son <b>$TOGGLETEXT</b>.

source: Theme name $NEWNAME is protected. Choose another name
gl_es: Tema $NEWNAME está protexido. Escolle outro nome.

source: This tool edits the rofi config file.\n\nThe existing file will be backed up as \n\n<b>$HOME/.restore/rofi/config.rasi_$NOW</b>
gl_es: Esta ferramenta edita o ficheiro de configuração do rofi.\n\nO ficheiro existente será copiado como\n\n<b>$HOME/.restore/rofi/config.rasi_$NOW</b>

source: Title Background
gl_es: Fondo do Título

source: Title Text
gl_es: Texto do título

source: Width (percentage of screen width)
gl_es: Ancho (porcentaxe do ancho da pantalla)

source: \n<b> Choose which theme to use as a starting point</b>\n
gl_es: Escolle qué tema usar como punto de partida.

source: \n<b>Select the rofi theme you wish to edit</b>\n\nThe .rasi file will be opened in your preferred text editor\n\n
gl_es: \n<b>Selecciona o tema de rofi que desexas editar</b>\n\nO ficheiro .rasi abrirase no teu editor de texto preferido\n\n

source: \nThe theme to be edited has been saved in\n<b>$ROFIPATH</b> as\n\n<b>$EDITTHEMECOPY</b>\n\n
gl_es: \nO tema a ser editado foi gardado en\n<b>$ROFIPATH</b> como\n\n<b>$EDITTHEMECOPY</b>\n\n

source: a powerful calculation engine
gl_es: un motor de cálculo potente

source: a set of links about using rofi
gl_es: un conxunto de ligazóns sobre o uso de rofi

source: displays all available executable files
gl_es: mostra todos os ficheiros executables dispoñibles

source: enables easy switching
gl_es: permite cambiar facilmente

source: fast access to files
gl_es: acceso rápido a ficheiros

source: mxrr-color-selector
gl_es: mxrr-selectar-cor

source: opens a secure shell
gl_es: abre un shell seguro

source: tab will not be shown\n
gl_es: tab non se mostrará\n

source: the MX default that displays available apps
gl_es: a opción predeterminada que mostra as aplicacións dispoñibles

source: Rofi Manager
gl_es: Xestor de Rofi

source: Easily change the rofi configuration
gl_es: Cambiar facilmente a configuración de rofi
